# Melt & Pivote

In [6]:
import numpy as np
from sklearn.datasets import load_boston
import pandas as pd

In [10]:
import random

In [25]:
df = pd.DataFrame({'A': ['a','b','c','d','a','b','w','c','a','b'],
...                    'B': [random.randint(0,10) for _ in range(10)],
...                    'C': [random.randint(0,10) for _ in range(10)]})
df.head()

   A  B  C
0  a  9  3
1  b  3  0
2  c  2  7
3  d  5  3
4  a  7  2

In [31]:
pd_melt = pd.melt(df,id_vars='A',value_vars=['B','C'],var_name='Test',value_name='Result')
pd_melt.head()

   A Test  Result
0  a    B       9
1  b    B       3
2  c    B       2
3  d    B       5
4  a    B       7

In [35]:
pd_melt.pivot_table(index='A',columns='Test',values='Result',aggfunc=np.sum)

Test   B   C
A
a     26   6
b     11  12
c      6  12
d      5   3
w      8   5